### Terraform Plan Results

#### Format Check: `failure`
#### Init: `success`
#### Validate: `success`
#### Plan: `success`

<details><summary>Show Plan Output</summary>

```terraform
aws_s3_bucket.demo: Refreshing state... [id=cloudburst-demo-cco-124]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.demo has been deleted
  - resource "aws_s3_bucket" "demo" {
      - bucket                      = "cloudburst-demo-cco-124" -> null
        id                          = "cloudburst-demo-cco-124"
        tags                        = {
            "DeployedBy"  = "github-actions"
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "CloudBurst Demo Bucket"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.demo will be created
  + resource "aws_s3_bucket" "demo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cloudburst-dev-cco"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "DeployedBy"  = "github-actions"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "CloudBurst dev Bucket"
          + "TestTag"     = "pr-comment-test"
        }
      + tags_all                    = {
          + "DeployedBy"  = "github-actions"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "CloudBurst dev Bucket"
          + "TestTag"     = "pr-comment-test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - bucket_arn  = "arn:aws:s3:::cloudburst-demo-cco-124" -> null
  ~ bucket_name = "cloudburst-demo-cco-124" -> "cloudburst-dev-cco"
  + environment = "dev"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @chichiGithub*